[
  {
    "Major": 0,
    "Releases": {
      "Minor": 5,
      "Releases": [
        {
          "name": "0.5.1",
          "publishedAt": "2016-08-11T07:33:21Z",
          "tagName": "0.5.1",
          "version": "0.5.1"
        }
      ],
      "summary": "The latest update introduces several user-focused enhancements, including new features that improve overall functionality and user experience. Key improvements have been made to performance and stability, ensuring smoother operation. Additionally, various bug fixes have been implemented to address previously reported issues, enhancing reliability and user satisfaction."
    },
    "summary": "The latest update introduces several user-focused enhancements, including new features that improve overall functionality and user experience. Key improvements have been made to performance and stability, ensuring smoother operation. Additionally, various bug fixes have been implemented to address previously reported issues, enhancing reliability and user satisfaction."
  },
  {
    "Major": 3,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "3.0.0.41",
            "publishedAt": "2016-08-17T03:13:04Z",
            "tagName": "3.0.0.41",
            "version": "3.0.0.41",
            "description": "The recent changes in the LinkMigrationContext.cs file update the query used to retrieve work items by removing a condition that filters out items with a specific description, and also eliminate the addition of a marker (\"##LINKS-DONE##\") to the work item descriptions after processing, which may affect how users track the completion of link migrations."
          }
        ],
        "summary": "Recent updates have improved the retrieval of work items by modifying the query to include all items, regardless of their description, enhancing user access to relevant data. Additionally, the removal of the marker (\"##LINKS-DONE##\") from work item descriptions post-processing may impact how users monitor the status of link migrations."
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "3.1.0.2",
            "publishedAt": "2016-08-17T06:16:07Z",
            "tagName": "3.1.0.2",
            "version": "3.1.0.2",
            "description": "The recent updates include the addition of a new configuration option, `AreaIterationPath`, to the `TestPlansAndSuitsMigrationConfig` class, enhancing the flexibility of migration settings, while various trace logging statements have been modified to include a consistent identifier, \"vstsbulkeditor,\" improving the clarity of log outputs during execution and migration processes."
          }
        ],
        "summary": "The latest updates introduce a new configuration option, `AreaIterationPath`, to the `TestPlansAndSuitsMigrationConfig` class, which enhances migration settings flexibility. Additionally, trace logging statements have been improved with a consistent identifier, \"vstsbulkeditor,\" resulting in clearer log outputs during execution and migration processes."
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "3.2.3.1",
            "publishedAt": "2016-08-17T09:29:23Z",
            "tagName": "3.2.3.1",
            "version": "3.2.3.1",
            "description": "The update to the `mkdocs.yml` file introduces a new page titled \"Why\" that links to `why.md`, expanding the documentation structure to provide additional context for users."
          }
        ],
        "summary": "The recent update introduces a new page titled \"Why\" in the documentation, linking to `why.md`, which enhances the overall documentation structure and provides users with additional context and insights."
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "3.3.0.4",
            "publishedAt": "2016-08-19T01:56:47Z",
            "tagName": "3.3.0.4",
            "version": "3.3.0.4",
            "description": "This release introduces several changes, including the modification of the `Program` class to be public, allowing for broader access, and the addition of unit tests for the `EngineConfiguration` and `MigrationEngine` classes, which enhance the testing framework. Additionally, new configuration files and project references have been established for the test projects, ensuring proper assembly binding and dependencies, particularly for Newtonsoft.Json."
          }
        ],
        "summary": "This update introduces significant changes, including making the `Program` class public for broader access, enhancing user interaction. It also adds unit tests for the `EngineConfiguration` and `MigrationEngine` classes, improving the overall testing framework. Furthermore, new configuration files and project references have been established for test projects, ensuring proper assembly binding and dependencies, particularly for Newtonsoft.Json, which enhances stability and reliability."
      },
      {
        "Minor": 4,
        "Releases": [
          {
            "name": "3.4.1.1",
            "publishedAt": "2016-08-22T10:52:04Z",
            "tagName": "3.4.1.1",
            "version": "3.4.1.1",
            "description": "This release introduces a new configuration option for mapping field values to tags, allowing users to specify a source field, a pattern for matching values, and a format expression for tag creation, enhancing the flexibility of work item tagging in the TfsWitMigrator tool."
          }
        ],
        "summary": "This update introduces a new configuration option for mapping field values to tags, enabling users to define a source field, a matching pattern, and a format expression for tag creation, which significantly enhances the flexibility of work item tagging in the TfsWitMigrator tool."
      },
      {
        "Minor": 5,
        "Releases": [
          {
            "name": "3.5.0.2",
            "publishedAt": "2016-08-24T09:21:34Z",
            "tagName": "3.5.0.2",
            "version": "3.5.0.2",
            "description": "The documentation for the Visual Studio Team Services Bulk Data Editor Engine has been updated to clarify the functionality of various mapping tools and processors, including new options for field mapping such as FieldMergeMap and FieldBlankMap, as well as enhancements to the WorkItemUpdate and WorkItemDelete processors, providing users with more flexibility and control over data migration and updates."
          }
        ],
        "summary": "This update introduces enhanced documentation for the Visual Studio Team Services Bulk Data Editor Engine, clarifying the functionality of various mapping tools and processors. Notable new options for field mapping, including FieldMergeMap and FieldBlankMap, have been added, along with improvements to the WorkItemUpdate and WorkItemDelete processors, offering users greater flexibility and control over data migration and updates."
      },
      {
        "Minor": 6,
        "Releases": [
          {
            "name": "3.6.0.1",
            "publishedAt": "2016-09-27T09:49:01Z",
            "tagName": "3.6.0.1",
            "version": "3.6.0.1",
            "description": "The recent changes include the addition of logic in the `TestPlansAndSuitsMigrationContext` to conditionally set the `AreaPath` and `Iteration` properties based on the presence of a configuration value, allowing for more flexible migration options, while in the `TestVeriablesMigrationContext`, the handling of test variables has been updated to create new variables and their allowed values if they do not already exist, enhancing the migration process for test variables."
          }
        ],
        "summary": "Recent updates enhance the migration process by introducing conditional logic in the `TestPlansAndSuitsMigrationContext`, allowing users to set `AreaPath` and `Iteration` properties based on configuration values for greater flexibility. Additionally, the `TestVariablesMigrationContext` has been improved to automatically create new test variables and their allowed values if they do not already exist, streamlining the management of test variables during migration."
      }
    ],
    "summary": "The latest updates introduce significant enhancements for users, including improved retrieval of work items without filtering by description, which broadens access to relevant data. A new configuration option for mapping field values to tags allows for greater flexibility in tagging work items. Enhanced documentation clarifies the functionality of mapping tools and processors, while new options for field mapping and improvements to migration processes for test plans and variables streamline user experience. Additionally, the public access to the `Program` class and the introduction of unit tests bolster the overall stability and reliability of the tool."
  },
  {
    "Major": 4,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "4.0.0.2",
            "publishedAt": "2016-10-03T10:21:31Z",
            "tagName": "4.0.0.2",
            "version": "4.0.0.2",
            "description": "This release introduces a new configuration option, `PrefixProjectToNodes`, in the `WorkItemMigrationConfig` class, allowing users to control whether the project name is prefixed to area and iteration paths during work item migration, enhancing flexibility in project structure management. Additionally, the migration logic has been updated to accommodate this new option, affecting how area and iteration paths are constructed based on the user's configuration settings."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "4.1.0.2",
            "publishedAt": "2016-10-10T22:02:12Z",
            "tagName": "4.1.0.2",
            "version": "4.1.0.2",
            "description": "This release introduces a new configuration option, `PrefixProjectToNodes`, in the `NodeStructuresMigrationConfig` class, allowing users to specify whether project names should be prefixed to nodes during migration. Additionally, the migration context has been updated to utilize this new configuration option, enhancing the flexibility of node structure processing in the migration workflow. The project and license URLs in the `.nuspec` file have also been updated to reflect the new repository location."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "4.2.0",
            "publishedAt": "2016-10-12T18:06:16Z",
            "tagName": "4.2.0",
            "version": "4.2.0",
            "description": "This release introduces a new Chocolatey package for the VSTS Sync Migrator, including a PowerShell installation script and a nuspec file, allowing users to easily install and manage the tool via Chocolatey. Additionally, the configuration for the Test Plans and Suits migration has been updated to include a new option, `PrefixProjectToNodes`, which allows users to control how project names are prefixed in the migration process."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "4.3.0",
            "publishedAt": "2016-10-17T18:49:14Z",
            "tagName": "4.3.0",
            "version": "4.3.0",
            "description": "The recent updates include a change in the `next-version` from 2.1.0 to 4.2.0 in the GitVersion configuration, the introduction of a new uninstall script for the VSTS Sync Migration tool, and modifications to the package metadata, including a new ID format and the addition of an icon URL. Additionally, new JSON configuration files have been added to the documentation, and the documentation now provides clearer instructions on obtaining the tools, emphasizing the recommended installation via Chocolatey."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 4,
        "Releases": [
          {
            "name": "4.4.0",
            "publishedAt": "2016-10-18T19:49:08Z",
            "tagName": "4.4.0",
            "version": "4.4.0",
            "description": "This release introduces updates to the README and documentation, clarifying the installation options for the VSTS Bulk Data Editor Engine, including recommended methods such as installing via Chocolatey, downloading the latest release from GitHub, or creating custom tools using the NuGet package. Additionally, the codebase has been modified to enhance the functionality of the `FindReflectedWorkItem` method by adding a caching option, and an ignore list has been implemented to exclude specific fields during work item migration."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 5,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "5.0.1",
            "publishedAt": "2016-10-19T18:23:47Z",
            "tagName": "5.0.1",
            "version": "5.0.1",
            "description": "The recent updates include a version bump from 4.2.0 to 5.0.0 in the GitVersion configuration, a rebranding of the project from \"VSTS Bulk Data Editor & Migrator\" to \"VSTS Sync Migration Tools,\" and the introduction of new documentation files that provide guidance on configuration and getting started with the tools, emphasizing the need for a configuration file to operate effectively. Additionally, the configuration documentation has been updated to reflect changes in command usage and the structure of the configuration file, which now includes new options for processing work items and links."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "5.1.0",
            "publishedAt": "2016-10-19T18:44:04Z",
            "tagName": "5.1.0",
            "version": "5.1.0",
            "description": "The git diff introduces several updates, including the addition of new configuration options for user preferences, enhancements to existing command-line flags for improved functionality, and adjustments to default settings that streamline user experience."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "5.3.2",
            "publishedAt": "2016-10-24T20:38:27Z",
            "tagName": "5.3.2",
            "version": "5.3.2",
            "description": "The update introduces a new method, `ProcessChildTestCases`, in the `TestPlansAndSuitsMigrationContext` class, which enhances the migration process by adding the capability to handle test cases during the migration of test plans and suites."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 6,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "6.0.2",
            "publishedAt": "2017-01-02T22:57:10Z",
            "tagName": "6.0.2",
            "version": "6.0.2",
            "description": "The recent updates include a version bump in the GitVersion configuration from 6.0.1 to 6.0.2, changes to the command-line tool name from `vsts-sm` to `vstssyncmigrator`, and adjustments in the documentation to reflect this new command name for initializing configuration files and running the tools, ensuring users are aware of the correct commands to use for setup and execution."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "6.1.0",
            "publishedAt": "2017-01-24T20:12:29Z",
            "tagName": "6.1.0",
            "version": "6.1.0",
            "description": "This release introduces several configuration updates, including an increment in the next version from 6.0.2 to 6.1.0, and modifications to the global configuration documentation to clarify the structure and options available for users. Notably, the default state of various processors has been changed to enabled, allowing for immediate functionality upon configuration, and the command-line documentation has been enhanced to emphasize the necessity of enabling processors for them to execute. Additionally, there are improvements in the handling of link migrations and test plans, ensuring better traceability and error handling during the migration process."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "6.2.0",
            "publishedAt": "2017-01-25T17:07:16Z",
            "tagName": "6.2.0",
            "version": "6.2.0",
            "description": "The recent updates include a change in the `next-version` from 6.1.0 to 6.2.0 in the GitVersion configuration, the addition of a new `WorkItemQueryMigrationContext` and its corresponding configuration class `WorkItemQueryMigrationConfig`, which allows users to enable or disable the migration of work item queries and choose whether to prefix project names in folder paths, enhancing the migration options available for users."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "6.3.1",
            "publishedAt": "2017-02-23T13:44:22Z",
            "tagName": "6.3.1",
            "version": "6.3.1",
            "description": "This release includes an update to the `next-version` in the GitVersion configuration from 6.3.0 to 6.3.1, a clarification in the FAQ regarding the consistency requirement of the `PrefixProjectToNodes` setting across processors, and the addition of a new FAQ section addressing potential migration errors. Additionally, the console application now features enhanced logging that informs users of the current and latest available versions, along with a prompt to upgrade if a newer version is detected."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 7,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "7.0.2",
            "publishedAt": "2017-04-28T19:27:17Z",
            "tagName": "7.0.2",
            "version": "7.0.2",
            "description": "The Git diff updates the `next-version` in the `GitVersion.yml` file from 7.0.1 to 7.0.2, indicating a new version release, and comments out the conditional trace listener initialization in the `Telemetry.cs` file, which may affect how telemetry data is logged during application execution."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "7.1.8",
            "publishedAt": "2017-07-19T10:51:15Z",
            "tagName": "7.1.8",
            "version": "7.1.8",
            "description": "This release includes an update to the `next-version` in the `GitVersion.yml` file from 7.1.7 to 7.1.8, a change in the target framework version from v4.6.2 to v4.6.1 across multiple project files, and updates to the `ApplicationInsights.config` file with a new instrumentation key. Additionally, the app configuration files have been modified to streamline XML formatting and ensure consistent assembly binding redirects for various dependencies."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "7.2.0",
            "publishedAt": "2017-08-01T10:07:30Z",
            "tagName": "7.2.0",
            "version": "7.2.0",
            "description": "The release includes an update to the `next-version` in the `GitVersion.yml` file, changing it from 7.1.8 to 7.2.0, and enhancements to the `vss-extension.json` file for the VSTS Sync Migration Tools, which now includes a repository link, updated support links, and maintains the same functionality for bulk editing and migrating work items in TFS & VSTS."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 4,
        "Releases": [
          {
            "name": "7.4.2",
            "publishedAt": "2017-08-12T16:08:54Z",
            "tagName": "7.4.2",
            "version": "7.4.2",
            "description": "The recent changes to the `AttachementExportMigrationContext.cs` file include the addition of a new using directive for `Microsoft.TeamFoundation.WorkItemTracking.Proxy`, the replacement of the `WebClient` for downloading attachments with a method from `WorkItemServer`, and enhanced error logging that provides more detailed exception messages during the attachment download process."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 5,
        "Releases": [
          {
            "name": "7.5.74",
            "publishedAt": "2019-09-18T08:46:33Z",
            "tagName": "7.5.74",
            "version": "7.5.74",
            "description": "The recent changes include an update to the `next-version` in the `GitVersion.yml` file from 7.5.0 to 8.0.0, the addition of a new configuration option `ReplayRevisions` in the `WorkItemMigrationConfig` class, and modifications to the documentation to clarify the configuration requirements for the `ReflectedWorkItemIDFieldName` in both source and target configurations, enhancing user guidance on customization and setup."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 8,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v8.0.17",
            "publishedAt": "2019-09-28T10:15:31Z",
            "tagName": "v8.0.17",
            "version": "8.0.17",
            "description": "The recent updates include modifications to the configuration file structure, introducing new options for the `init` command, such as specifying a custom configuration file path and selecting between `Full` and `WorkItemTracking` modes, which affects the complexity of the generated configuration. Additionally, the default values for telemetry and source/target collections have been updated, and several processors have been reconfigured or added, impacting how work items and attachments are processed during migration."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v8.1.9",
            "publishedAt": "2019-10-07T23:42:08Z",
            "tagName": "v8.1.9",
            "version": "8.1.9",
            "description": "The update modifies the console title of the Azure DevOps Migration Tools to include the configuration file name, version number, and source and target names, enhancing user visibility into the current migration context."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v8.2.6",
            "publishedAt": "2019-10-10T14:36:38Z",
            "tagName": "v8.2.6",
            "version": "8.2.6",
            "description": "The recent changes to the `TestPlansAndSuitesMigrationContext` class include enhancements to logging output formatting, the introduction of a filtering option for completed test plans, and the restructuring of the process for handling test plans and suites, which now includes improved metrics tracking and telemetry for migration events, allowing users to better monitor the migration process and its performance."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "v8.3.8",
            "publishedAt": "2019-10-19T10:26:17Z",
            "tagName": "v8.3.8",
            "version": "8.3.8",
            "description": "The README.md file has been updated to correct a typographical error in the support section, changing \"paied\" to \"paid\" and \"avilable\" to \"available,\" ensuring clarity in the information regarding support options for users."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 4,
        "Releases": [
          {
            "name": "v8.4.7",
            "publishedAt": "2019-10-31T13:38:59Z",
            "tagName": "v8.4.7",
            "version": "8.4.7",
            "description": "The recent updates include the addition of two new configuration options: `WorkItemCreateRetryLimit`, which allows for retrying failed work item saves, and `FilterWorkItemsThatAlreadyExistInTarget`, which optimizes the migration process by filtering out existing target work items before migration begins. Additionally, the global configuration now includes a version update to 8.4, changes to project naming conventions, and adjustments to the `QueryBit` and `OrderBit` settings to refine work item selection and migration order."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 5,
        "Releases": [
          {
            "name": "v8.5.5",
            "publishedAt": "2019-11-18T12:38:06Z",
            "tagName": "v8.5.5",
            "version": "8.5.5",
            "description": "The README.md file has been updated to reflect a change in the project name from \"vsts-sync-migrator\" to \"azure-devops-migration-tools,\" along with corresponding updates to the GitHub release links and documentation references, ensuring users are directed to the correct resources for the Azure DevOps Migration Tools."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 6,
        "Releases": [
          {
            "name": "v8.6.9",
            "publishedAt": "2019-12-17T22:37:11Z",
            "tagName": "v8.6.9",
            "version": "8.6.9",
            "description": "The recent changes in the TeamMigrationContext.cs file update the project prefixing logic for backlog iteration paths and iteration paths, ensuring that the target project's configuration is correctly referenced instead of the source project's configuration, which may affect how users set up their team settings during migration."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 7,
        "Releases": [
          {
            "name": "v8.7.3",
            "publishedAt": "2020-02-19T13:51:11Z",
            "tagName": "v8.7.3",
            "version": "8.7.3",
            "description": "The recent changes in the `TestPlansAndSuitesMigrationContext.cs` file include modifications to the handling of work item assignments and test point assignments, specifically altering the flow of control from breaking to continuing when a work item is not found, and refining the logic for translating source configuration IDs to target configuration IDs, which may affect how test point assignments are created and managed during migration."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 8,
        "Releases": [
          {
            "name": "v8.8.0",
            "publishedAt": "2020-02-21T10:56:44Z",
            "tagName": "v8.8.0",
            "version": "8.8.0",
            "description": "This release introduces a new configuration option, `SkipToFinalRevisedWorkItemType`, which allows users to migrate work items using the most recent revision's work item type when a type change is detected, specifically for migrations from Azure DevOps Service to Azure DevOps Server, enhancing flexibility in handling work item types during migration. Additionally, the `FilterWorkItemsThatAlreadyExistInTarget` option has been updated to improve migration efficiency by excluding already migrated work items from the source list."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 9,
        "Releases": [
          {
            "name": "v8.9.10",
            "publishedAt": "2020-08-06T15:12:29Z",
            "tagName": "v8.9.10",
            "version": "8.9.10",
            "description": "The recent changes in the TestPlansAndSuitesMigrationContext.cs file include modifications to the method for finding reflected work items, now requiring an integer conversion for the query ID, and added null checks for the target plan before executing refresh and save operations, which may affect how users manage test suite queries and their associated plans."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 9,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v9.0.1",
            "publishedAt": "2020-08-13T12:18:36Z",
            "tagName": "v9.0.1",
            "version": "9.0.1",
            "description": "This release introduces a new funding configuration file, updates the `doneMatch` property in the `FieldMergeMapConfig` class to indicate it is deprecated, modifies error handling to prevent matching source and target fields, and enhances the merging logic to improve field updates, along with a change in the URI for the getting started guide in the extension's configuration."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v9.1.1",
            "publishedAt": "2020-08-13T13:37:49Z",
            "tagName": "v9.1.1",
            "version": "9.1.1",
            "description": "The recent changes to the WorkItemMigrationContext class introduce conditional logic to exclude \"Test Plan\" and \"Test Suite\" work item types from certain migration processes, enhancing the handling of work item revisions and metrics, while also ensuring that appropriate messages are logged when migration is skipped for unsupported types. Additionally, the code now includes improved management of work item states, such as closing source and target work items after processing, and adds parameters for tracking target work item revisions."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v9.2.0",
            "publishedAt": "2020-08-21T12:14:38Z",
            "tagName": "v9.2.0",
            "version": "9.2.0",
            "description": "The recent changes include an update to the configuration documentation, where the key \"LanguageMap\" has been renamed to \"LanguageMaps\" and the mapping for \"AreaPath\" has been corrected to \"IterationPath,\" ensuring clarity in the configuration structure. Additionally, error handling in the WorkItemQueryMigrationContext has been enhanced to provide more detailed logging of source and target queries when saving fails, aiding in troubleshooting."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "v9.3.1",
            "publishedAt": "2020-09-07T09:33:45Z",
            "tagName": "v9.3.1",
            "version": "9.3.1",
            "description": null
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 10,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v10.0.10",
            "publishedAt": "2020-09-14T11:35:30Z",
            "tagName": "v10.0.10",
            "version": "10.0.10",
            "description": "The recent update to the VstsSyncMigrator.Console application introduces a check for the configuration file to ensure compatibility with the new namespace, changing from 'VstsSyncMigrator.Engine.Configuration' to 'MigrationTools.Engine.Configuration', and logs an error message if the old namespace is detected, prompting users to update their configuration accordingly."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v10.1.1",
            "publishedAt": "2020-09-16T08:00:12Z",
            "tagName": "v10.1.1",
            "version": "10.1.1",
            "description": null
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v10.2.13",
            "publishedAt": "2020-09-27T17:53:35Z",
            "tagName": "v10.2.13",
            "version": "10.2.13",
            "description": "The documentation has been updated to include a new resource for migrating test artifacts and work item types using Azure DevOps, as well as the addition of two new consultants, Ove Bastiansen and Gordon Beeming, providing their contact information for support."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 11,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v11.0.2",
            "publishedAt": "2020-09-29T03:23:34Z",
            "tagName": "v11.0.2",
            "version": "11.0.2",
            "description": "The recent changes include renaming several projects and files to reflect a shift from \"VstsSyncMigrator\" to \"MigrationTools,\" with specific focus on Azure DevOps and File System clients, as well as updates to configuration interfaces and classes to standardize naming conventions. Additionally, the solution structure has been modified to remove obsolete projects and streamline the configuration options for processors and field maps, enhancing clarity and usability for developers."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v11.1.4",
            "publishedAt": "2020-09-30T19:39:33Z",
            "tagName": "v11.1.4",
            "version": "11.1.4",
            "description": "The recent changes to the MigrationToolHost.cs file introduce a conditional registration of hosted services based on command-line arguments, allowing users to specify whether to initialize the service or execute it directly by using the \"init\" argument, thereby enhancing flexibility in service management."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v11.2.1",
            "publishedAt": "2020-10-02T10:41:52Z",
            "tagName": "v11.2.1",
            "version": "11.2.1",
            "description": "In this release, the configuration for migration tools has been updated to remove the `NodeStructuresMigrationConfig`, which has been deprecated and replaced with a more streamlined approach that integrates node structure migration into the `WorkItemMigrationConfig`. Additionally, new options for specifying `NodeBasePaths` have been introduced, allowing users to define base paths for areas and iterations directly within the work item migration configuration. The documentation has also been updated to reflect these changes, ensuring users have the latest information on configuration options."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "v11.3.3",
            "publishedAt": "2020-10-02T15:36:37Z",
            "tagName": "v11.3.3",
            "version": "11.3.3",
            "description": "The recent update modifies the retrieval of the target project in the WorkItemMigrationContext class, changing the source of the project information from the source work items to the target work items, which may affect how users configure and manage project migrations."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 4,
        "Releases": [
          {
            "name": "v11.4.3",
            "publishedAt": "2020-10-03T12:08:10Z",
            "tagName": "v11.4.3",
            "version": "11.4.3",
            "description": "The update modifies the version retrieval method in the StartupService.cs file, changing it from using the executing assembly to the entry assembly, which may affect how the application identifies its current version and prompts users to upgrade to the latest version using the specified Chocolatey command."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 5,
        "Releases": [
          {
            "name": "v11.5.18",
            "publishedAt": "2020-10-09T08:44:35Z",
            "tagName": "v11.5.18",
            "version": "11.5.18",
            "description": "The recent changes include the introduction of a new configuration structure, replacing the previous `TeamProjectConfig` with an interface `IMigrationClientConfig`, which allows for more flexible configuration management. The configuration now includes an `ObjectType` field, and various properties such as `Collection`, `Project`, and `ReflectedWorkItemIDFieldName` have been updated to utilize this new interface. Additionally, several methods and properties across the codebase have been modified to reference the new configuration structure, ensuring that the migration tools can now handle configurations more dynamically and robustly."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 6,
        "Releases": [
          {
            "name": "v11.6.46",
            "publishedAt": "2020-11-11T10:18:37Z",
            "tagName": "v11.6.46",
            "version": "11.6.46",
            "description": "This release introduces several logging enhancements in the Azure DevOps migration tools, adding debug and verbose log statements to key methods such as `SaveToAzureDevOps`, `ToJson`, and `RefreshWorkItem`, which will aid in tracking the flow and state of work item operations. Additionally, test categories have been updated across various test methods to improve organization and clarity in the testing framework, with several tests now categorized under higher-level test categories (L1, L2, L3)."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 7,
        "Releases": [
          {
            "name": "v11.7.7",
            "publishedAt": "2020-11-15T09:58:05Z",
            "tagName": "v11.7.7",
            "version": "11.7.7",
            "description": "The recent updates include modifications to the `RefreshWorkItem` and `AsWorkItemData` methods in the `TfsExtensions` class, allowing for an optional `FieldCollection` parameter to customize the fields retrieved for work items, enhancing flexibility in handling revisions. Additionally, the `RevisionItem` class has been updated to include new properties for `Type` and `Fields`, while the `WorkItemData` class now utilizes getter-only properties for certain fields to improve data integrity and performance. The `GetRevision` method in the `WorkItemMigrationContext` has also been streamlined to directly access revisions, improving efficiency in migration processes."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 8,
        "Releases": [
          {
            "name": "v11.8.4",
            "publishedAt": "2020-11-16T09:51:06Z",
            "tagName": "v11.8.4",
            "version": "11.8.4",
            "description": "This release introduces changes to the configuration handling in the MigrationTools application, including the addition of a default configuration file (\"configuration.json\") for the migration engine, which is now required for execution. The test setup has been updated to utilize this configuration file, and several test methods have been temporarily ignored due to the absence of a suitable configuration file. Additionally, the project file now includes links to the configuration files to ensure they are copied to the output directory, enhancing the overall configuration management process."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 9,
        "Releases": [
          {
            "name": "v11.9.55",
            "publishedAt": "2021-07-04T11:43:55Z",
            "tagName": "v11.9.55",
            "version": "11.9.55",
            "description": "This release introduces the `TfsRevisionManager` and its associated options class, `TfsRevisionManagerOptions`, which allow users to configure settings such as enabling revision replay, setting a maximum number of revisions to migrate, and collapsing revisions into a single attachment. Additionally, the `MaxRevisions` property has been added to the existing `WorkItemMigrationConfig` class, enhancing the configuration capabilities for migration processes. The `TfsRevisionManager` is now integrated into the service collection, ensuring it is available for use in migration contexts."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 10,
        "Releases": [
          {
            "name": "v11.10.1",
            "publishedAt": "2021-07-06T09:38:09Z",
            "tagName": "v11.10.1",
            "version": "11.10.1",
            "description": "The recent changes include enhancements to error logging and debugging within the TfsWorkItemLinkEnricher, specifically improving the handling of related links and providing more detailed log messages for various scenarios, while the TfsRevisionManager has commented out a section related to the handling of revision limits, which may affect how revisions are processed and reported."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 11,
        "Releases": [
          {
            "name": "v11.11.27",
            "publishedAt": "2022-02-19T21:44:11Z",
            "tagName": "v11.11.27",
            "version": "11.11.27",
            "description": "This update introduces several changes to the `BuildDefinitions.cs` file, including the addition of a `YamlFilename` property and corresponding serialization logic based on the `Type` of the pipeline, as well as initializing the `Phases` and `Steps` arrays to empty by default. Additionally, the `Clean` property has been modified to allow nullable boolean values, enhancing flexibility in configuration."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 12,
        "Releases": [
          {
            "name": "v11.12.23",
            "publishedAt": "2022-06-06T15:58:04Z",
            "tagName": "v11.12.23",
            "version": "11.12.23",
            "description": "The recent changes introduce a new boolean parameter, `PrefixProjectToNodes`, to the `FixAreaPathAndIterationPathForTargetQuery` method, allowing users to specify whether to prefix the project name in the target query, which affects how area paths are constructed during work item migration; this change is reflected in multiple test cases to ensure the correct behavior based on this new option."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 12,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v12.0.38",
            "publishedAt": "2023-02-08T17:50:52Z",
            "tagName": "v12.0.38",
            "version": "12.0.38",
            "description": "This release introduces several updates to the configuration of field mappings in the Migration Tools, including the addition of a new Azure DevOps consultant to the documentation, a shift from individual source fields to a list of source fields in the `FieldMergeMapConfig`, and enhancements to the mapping display name functionality, allowing for more flexible field merging and validation checks to prevent conflicts between source and target fields."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v12.1.1",
            "publishedAt": "2023-02-09T12:28:43Z",
            "tagName": "v12.1.1",
            "version": "12.1.1",
            "description": "The update to the TfsNodeStructure.cs file introduces case-insensitive matching for regular expressions in both the mapping process and the validation of source node paths, enhancing flexibility in path recognition and error handling."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v12.2.1",
            "publishedAt": "2023-02-09T18:34:13Z",
            "tagName": "v12.2.1",
            "version": "12.2.1",
            "description": "This release introduces several enhancements to the configuration options for the WorkItemMigrationConfig processor, including new parameters such as ReplayRevisions, PrefixProjectToNodes, UpdateCreatedDate, and UpdateCreatedBy, which allow users to control the migration of work item revisions, project name prefixes, and original creation dates. Additionally, the documentation has been updated to reflect these changes, providing clearer guidance on the use of WIQL queries and various migration settings, while also consolidating the structure of the documentation to support both v1 and v2 APIs."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "v12.3.11",
            "publishedAt": "2023-02-24T17:09:49Z",
            "tagName": "v12.3.11",
            "version": "12.3.11",
            "description": "The GitVersion configuration has been updated to change the next version from 11.10 to 12.5, reflecting a new versioning scheme while maintaining the existing assembly versioning strategy and continuous deployment mode."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 5,
        "Releases": [
          {
            "name": "v12.5.0",
            "publishedAt": "2023-02-24T17:37:09Z",
            "tagName": "v12.5.0",
            "version": "12.5.0",
            "description": "The update introduces a new versioning scheme in the GitVersion configuration, changing the next version to 12.5.0, renaming the 'master' branch to 'main', and refining branch regex patterns for release and preview tags, while also removing the outdated GitVersion2.yml file and adding a new binary executable for GitVersion."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 6,
        "Releases": [
          {
            "name": "v12.6.2",
            "publishedAt": "2023-03-06T09:58:44Z",
            "tagName": "v12.6.2",
            "version": "12.6.2",
            "description": "The recent changes in the MigrationTools.Host codebase include the removal of the `RunExitLogic` method call during application shutdown, as well as the elimination of forced termination and logging statements related to application closure, which may affect how users handle application exits and logging during shutdown processes."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 7,
        "Releases": [
          {
            "name": "v12.7.1",
            "publishedAt": "2023-03-15T15:13:28Z",
            "tagName": "v12.7.1",
            "version": "12.7.1",
            "description": "The recent changes include an update to the `PersonalAccessToken` in the configuration file, the addition of a new `CommonEnrichersConfig` section with options for node structure processing, and the modification of the `UseCommonNodeStructureEnricherConfig` option to `true`, which enables the use of a shared configuration for node structure enrichment. Additionally, the migration configuration now includes a new option, `LinkMigrationSaveEachAsAdded`, set to `false`, and improvements in logging for validation processes related to target nodes."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 8,
        "Releases": [
          {
            "name": "v12.8.10",
            "publishedAt": "2023-04-25T12:25:48Z",
            "tagName": "v12.8.10",
            "version": "12.8.10",
            "description": "This release introduces the addition of the `jekyll-redirect-from` gem to the project, enhancing the configuration options for managing redirects, while also reinstating the `jekyll-optional-front-matter` gem. The `_config.yml` file has been updated to include new permalink settings and exclusion patterns, as well as default values for various page attributes such as `toc`, `pageType`, and `author`. Additionally, multiple documentation files have been updated to include `redirect_from` entries, ensuring that users are directed to the correct pages when accessing legacy URLs."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 13,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v13.0.9",
            "publishedAt": "2023-07-14T14:50:10Z",
            "tagName": "v13.0.9",
            "version": "13.0.9",
            "description": "The documentation for the TfsWorkItemEndpoint has been updated to improve formatting, including the addition of table headers for better clarity, while retaining the existing content regarding the various clients and their respective endpoints for reading and writing work items."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v13.1.1",
            "publishedAt": "2023-08-30T14:52:59Z",
            "tagName": "v13.1.1",
            "version": "13.1.1",
            "description": "This release introduces a new command-line option to disable telemetry collection by passing `--telemetry off`, which can be set in the migration command, and updates the launch settings to include this option by default. Additionally, the documentation has been updated to reflect these changes and provide guidance on how to manage telemetry settings."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v13.2.1",
            "publishedAt": "2023-10-09T15:59:49Z",
            "tagName": "v13.2.1",
            "version": "13.2.1",
            "description": "This release introduces changes to the configuration settings in `configuration.json`, specifically updating the options for `StopMigrationOnMissingAreaIterationNodes` to true and `ShouldCreateMissingRevisionPaths` to false, which may alter migration behavior. Additionally, the migration tool's host code now includes a null check for `executeOptions` when parsing the `DisableTelemetry` option, enhancing robustness. Lastly, improvements in the `TestPlansAndSuitesMigrationContext` include validation checks for test suite and test plan entries to ensure they match expected identifiers, potentially improving data integrity during migrations."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 14,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v14.0.3 (Bug in version detext on Windows Server)",
            "publishedAt": "2023-10-26T15:55:00Z",
            "tagName": "v14.0.3",
            "version": "14.0.3",
            "description": "The update modifies the command to create a default configuration file from `migration init` to `devopsmigration init`, and introduces the ability to pass `--options` when running the command, enhancing user flexibility in configuration. Additionally, logging output has been improved to include version information in the logs, providing better context for users during migration operations."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v14.1.0",
            "publishedAt": "2023-10-26T21:10:11Z",
            "tagName": "v14.1.0",
            "version": "14.1.0",
            "description": "The recent changes include an update to the command line arguments in the launch settings for the initialization command, removing the \"skipVersionCheck\" option, and modifications to the version detection logic to improve accuracy, including adjustments to how the running version is retrieved and displayed. Additionally, the project now references an updated version of the WGet.NET package, and logging verbosity has been enhanced for better debugging insights."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 2,
        "Releases": [
          {
            "name": "v14.2.3",
            "publishedAt": "2023-11-14T14:19:41Z",
            "tagName": "v14.2.3",
            "version": "14.2.3",
            "description": "The recent updates include changes to the command line arguments in the launch settings, specifically altering the configuration file path format, and modifying the default options for the 'init' command from 'Full' to 'Basic'. Additionally, a new 'Basic' option has been introduced in the options mode, while the 'Reference' option has been added to the configuration builder, allowing users to generate different types of configurations. Furthermore, the requirement for a Personal Access Token (PAT) when migrating to Azure DevOps has been enforced, ensuring users provide this token for certain actions."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 3,
        "Releases": [
          {
            "name": "v14.3.11",
            "publishedAt": "2024-01-09T11:58:29Z",
            "tagName": "v14.3.11",
            "version": "14.3.11",
            "description": "This release introduces several updates to the configuration options for the TFS Node Structure processor, including the addition of a new boolean parameter, `ReplicateAllExistingNodes`, which defaults to false, and maintains the existing option `ShouldCreateMissingRevisionPaths` as true. Additionally, the Git metadata has been updated to reflect the latest commit details, including changes to the branch and version numbers."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 4,
        "Releases": [
          {
            "name": "v14.4.7 - Add Azure DevOps 2022 to bug issue template",
            "publishedAt": "2024-02-06T14:46:11Z",
            "tagName": "v14.4.7",
            "version": "14.4.7",
            "description": "The bug report template has been updated to include Azure DevOps Server 2022 as an option for both data pulling and pushing configurations, enhancing the clarity and relevance of the version selection for users."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  },
  {
    "Major": 15,
    "Releases": [
      {
        "Minor": 0,
        "Releases": [
          {
            "name": "v15.0.4 - [master] Attachement Migration Fix (#2016)",
            "publishedAt": "2024-04-05T16:48:59Z",
            "tagName": "v15.0.4",
            "version": "15.0.4",
            "description": "The recent changes in the TfsAttachmentEnricher class include the removal of the private WorkItemServer field and the adjustment of the file download logic to utilize the _workItemServer instance instead of the removed _server, along with a modification in the condition for initializing the _workItemServer to ensure it is only set when it is null."
          }
        ],
        "Summary": null
      },
      {
        "Minor": 1,
        "Releases": [
          {
            "name": "v15.1.7 (Release)",
            "publishedAt": "2024-08-04T09:13:57Z",
            "tagName": "v15.1.7",
            "version": "15.1.7",
            "description": "This release includes updates to the GitHub Actions workflow to change the condition for setting the discussion category name to 'Announcement' based on the 'nkdAgility_Ring' environment variable, and it modifies project references in several solution files to point to the correct test projects. Additionally, the documentation has been updated to reflect the latest Git commit information, and various code files have been refactored to improve logging and error handling. The WinGet installer YAML files have also been updated to reflect a new package version and schema, while several obsolete files have been removed to streamline the project structure."
          }
        ],
        "Summary": null
      }
    ],
    "Summary": null
  }
]
